app/controllers/cards_controller.rb

UPDATE "users" SET "card_last4" = ?, "card_type" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["card_last4", "4444"], ["card_type", "MasterCard"], ["updated_at", 2016-08-07 05:22:01 UTC], ["id", 9]]
---
	def update
	    customer = Stripe::Customer.retrieve(current_user.stripe_id)
	    subscription = customer.subscriptions.retrieve(current_user.stripe_subscription_id)
	    subscription.source = params[:stripeToken]
	    subscription.save