app/controllers/subscriptions_controller.rb

  def create
    customer = if current_user.stripe_id?
                 Stripe::Customer.retrieve(current_user.stripe_id)
               else
                 Stripe::Customer.create(email: current_user.email)
               end

    subscription = customer.subscriptions.create(
      source: params[:stripeToken],
      plan: "monthly"
    )

    options = {
      stripe_id: customer.id,
      stripe_subscription_id: subscription.id,
    }

    # Only update the card on file if we're adding a new one
    options.merge!(
      card_last4: params[:card_last4],
      card_exp_month: params[:card_exp_month],
      card_exp_year: params[:card_exp_year],
      card_type: params[:card_brand]
    ) if params[:card_last4]

    current_user.update(options)
---
UPDATE "users" SET "stripe_subscription_id" = ?, "card_last4" = ?, "card_exp_month" = ?, "card_exp_year" = ?, "card_type" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["stripe_subscription_id", "sub_8xfQxUABDjbki5"], ["card_last4", nil], ["card_exp_month", nil], ["card_exp_year", nil], ["card_type", nil], ["updated_at", 2016-08-07 05:44:38 UTC], ["id", 9]]

  def destroy
    customer = Stripe::Customer.retrieve(current_user.stripe_id)
    customer.subscriptions.retrieve(current_user.stripe_subscription_id).delete
    current_user.update(stripe_subscription_id: nil)
---
UPDATE "users" SET "stripe_subscription_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["stripe_subscription_id", nil], ["updated_at", 2016-08-07 05:27:19 UTC], ["id", 9]]